_posts/2017-03-19-A-Hy-macro-for-defining-functions-with-docstrings-on-each-argument.html
---
title: A Hy macro for defining functions with docstrings on each argument
date: 2017/03/19 19:47:22
updated: 2017/03/19 19:47:22
categories: hylang,python
tags: 
---


<p>
For functions with a lot of arguments, python style docstrings leave something to be desired. For one, they are not that close to the arguments, so if you have a function with say 20 arguments, the docstring might take up a whole page! That means they are hard to keep synchronized too. Let's not argue now over the merits of a function with 20+ arguments, it is enough that they exist, and are a problem.
</p>

<p>
So what are typical documentation standards? Here is a Numpy style doc string:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">func</span>(arg1, arg2):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #036A07;">"""multiply arg1 and arg2</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   Parameters</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   ----------</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   arg1 : a number</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   arg2 : a number</span>

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #036A07;">   """</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> arg1 * arg2
</pre>
</div>

<p>
It works well for a small number of arguments with limited descriptions. This is a proper docstring that is accessible by introspection and pydoc. With much longer argument lists, this falls apart. I will not pick on any code in particular here, but suffice it to say I was inspired today to think of a better way. There are some other documentation solutions at <a href="http://stackoverflow.com/questions/9195455/how-to-document-a-method-with-parameters">http://stackoverflow.com/questions/9195455/how-to-document-a-method-with-parameters</a>, but None of them are better in my opinion. I want accessible docstrings by instrospection, and only if that is unavailable to I want to read the code! Finally, if I have to read the code, I want it to be easy to figure out.
</p>

<p>
There is bad news, I do not have one for vanilla python. Python does not even give you a way to deal with this. But, if we had a lisp, we could make a macro to help us out. In fact, we <i>have</i> a lisp with <a href="http://docs.hylang.org/en/latest/">hy</a>! And we can use a macro to make a  syntax that lets us keep the docstring close to the argument, <i>and</i> that constructs a real docstring so we get help later!
</p>

<p>
Here it is:
</p>

<div class="org-src-container">
<pre class="src src-jupyter-hy">(<span style="color: #0000FF;">defmacro</span> <span style="color: #006699;">mydef</span> [func args <span style="color: #6434A3;">&amp;optional</span> docstring <span style="color: #6434A3;">&amp;rest</span> body]
  `(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">~func</span> [~@(<span style="color: #006FE0;">map</span> (<span style="color: #0000FF;">lambda</span> [x] (<span style="color: #006FE0;">nth</span> x 0)) args)]
     ~(<span style="color: #006FE0;">+</span> (<span style="color: #0000FF;">if</span> docstring (<span style="color: #006FE0;">+</span> docstring <span style="color: #008000;">"\n\n"</span>) <span style="color: #008000;">""</span>)
         <span style="color: #008000;">"Parameters\n----------\n"</span>
         (.join <span style="color: #008000;">"\n"</span> (<span style="color: #006FE0;">map</span> (<span style="color: #0000FF;">lambda</span> [x]
                            (.format <span style="color: #008000;">"{} : {}"</span>
                                     (<span style="color: #006FE0;">nth</span> x 0)
                                     (<span style="color: #006FE0;">nth</span> x 1))) args)))
     ~@body))
</pre>
</div>

<p>
We can checkout how it expands like this:
</p>

<div class="org-src-container">
<pre class="src src-jupyter-hy">(<span style="color: #006FE0;">print</span> (<span style="color: #006FE0;">macroexpand</span> '(mydef f [(a <span style="color: #008000;">"an int"</span>)
                               (b <span style="color: #008000;">"an int"</span>)]
                            <span style="color: #008000;">"some doc"</span>
                            (<span style="color: #006FE0;">*</span> a b))))
</pre>
</div>
<p>
That looks ok. Now, for an example of using that. Here is the same function we defined before, but I put the documentation for each argument with the argument.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-hy">(mydef func ((arg1 <span style="color: #008000;">"a number"</span>)
             (arg2 <span style="color: #008000;">"a number"</span>))
  <span style="color: #008000;">"Multiply arg1 by arg2"</span>
  (<span style="color: #006FE0;">*</span> arg1 arg2))
</pre>
</div>

<p>
We can use the function now like a regular function.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-hy">(<span style="color: #006FE0;">print</span> (func 24 3))
</pre>
</div>

<p>
And now for the help.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-hy">(help func)
</pre>
</div>

<p>
Now, that should amaze and astonish you if you are a vanilla Pythonista! We have our cake, and we eat it too. You just can not make up your own syntax that way in Python. Imagine, we could add type information, validation code, etc&#x2026; into that macro. Maybe it could even be possible to store argument dependent documentation on the function, say in the function dictionary. That would require some conventions I guess,  but they could become introspectable then. For example, in this vanilla Python:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">def</span> <span style="color: #006699;">f</span>(x): <span style="color: #0000FF;">return</span> x*x
<span style="color: #BA36A5;">f.__dict__</span>[<span style="color: #008000;">'args'</span>] = {<span style="color: #008000;">'x'</span>: <span style="color: #008000;">'A number'</span>}
<span style="color: #0000FF;">print</span>(f.__dict__)
</pre>
</div>

<p>
{'args': {'x': 'A number'}}
</p>

<p>
In the end, this does not really solve all the problems I have with current docstrings in Python. It does solve a problem with writing and reading the code by keeping documentation close to the arguments, but ultimately the docstring from Python's point of view will basically look the same. It is pretty awesome that it is even possible. Hy lisp for the win here (again!).
</p>
<p>Copyright (C) 2017 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2017/03/19/A-Hy-macro-for-defining-functions-with-docstrings-on-each-argument.org">org-mode source</a></p>
<p>Org-mode version = 9.0.5</p>